Soway-code/Mindray/Mindray_V1_1_7_manual_adjust_V2/Source/BSP/inc/stm32l0_usart.h
/****************************************************************************************************************************************************************
** 版权:          2017-2027,深圳市信为科技发展有限公司
** 文件名:        stm32l0_usart.h
** 作者:          庄明群
** 版本:          V1.0.0
** 日期:          2017-05-02
** 描述:          STM32l072 通用串口配置
** 功能:          STM32L072 通用串口 RS485使能选择
*****************************************************************************************************************************************************************
** 修改者:        No
** 版本:          No
** 修改内容:      No
** 日期:          No
****************************************************************************************************************************************************************/

#ifndef __STM32L0_USART_H
#define __STM32L0_USART_H

#include "stm32l0xx_hal_rcc.h"
#include "stm32l0xx_hal_rcc_ex.h"
#include "stm32l0xx_hal_gpio.h"
#include "stm32l0xx_hal_gpio_ex.h"
#include "stm32l0xx_hal_dma.h"
#include "stm32l0xx_hal_uart.h"
#include "stm32l0xx_hal_uart_ex.h"
#include "stm32l0xx_hal_usart.h"
#include "stm32l0xx_hal_usart_ex.h"
#include "stm32l0xx_hal_cortex.h"
#include "VariaType.h"                                                                 

//以下的宏在stm32l0xx.h中定义
//typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
//FunctionalState 只有两种可能 使能和禁止

//串口端口引脚结构体
typedef struct
{
  USART_TypeDef *UARTx;
  GPIO_TypeDef *GPIOx;
  uint16_t UARTx_TX;
  uint16_t UARTx_RX;
}UARTx_PortTypeDef;

//串口通信参数结构体
typedef struct
{
  USART_TypeDef *UARTx;
  uint32_t UARTx_Baudrate;
  uint32_t UARTx_Parity;
  uint8_t UARTx_PreemptPrio;
  uint8_t UARTx_SubPrio;
  FunctionalState UARTx_IntEn;
}UARTx_ConfigTypeDef;

//****************************************************************************************************************************************************************
// 名称               : gUart_Rs485Gpio_Init()
// 创建日期           : 2017-05-02
// 作者               : 庄明群
// 功能               : RS485使能引脚配置
// 输入参数           : GPIO_TypeDef(端口),Gpio_Pin(引脚)
// 输出参数           : 无
// 返回结果           : 0(成功),1(失败)
// 注意和说明         : 
// 修改内容           :
//****************************************************************************************************************************************************************

uint8_t gUart_Rs485Gpio_Init(GPIO_TypeDef *GPIOx, uint16_t Gpio_Pin);

//****************************************************************************************************************************************************************
// 名称               : gUart_Gpio_Config()
// 创建日期           : 2017-05-02
// 作者               : 庄明群
// 功能               : 通用串口收发引脚配置
// 输入参数           : UARTx_PortTypeDef(串口端口引脚参数)
// 输出参数           : 无
// 返回结果           : 0(成功),1(失败)
// 注意和说明         : 支持通用串口重映射
// 修改内容           :
//****************************************************************************************************************************************************************

uint8_t gUart_Gpio_Config(UARTx_PortTypeDef *UART_PortInitStruct);

//****************************************************************************************************************************************************************
// 名称               : gUart_Param_Init()
// 创建日期           : 2017-05-02
// 作者               : 庄明群
// 功能               : 通用串口参数初始化
// 输入参数           : UARTx_ConfigTypeDef(串口通信参数)
// 输出参数           : UART_HandleTypeDef(串口处理结构体)
// 返回结果           : 0(成功),1(失败)
// 注意和说明         : 可选择中断
// 修改内容           :
//****************************************************************************************************************************************************************

uint8_t gUart_Param_Init(UART_HandleTypeDef *UART_HandleStruct, UARTx_ConfigTypeDef *UART_ConfigStruct);

#endif